from AdRenalen import app 
import asyncio
import random
from pyrogram import Client, filters
from pyrogram.enums import ChatType, ChatMemberStatus
from pyrogram.errors import UserNotParticipant
from pyrogram.types import ChatPermissions

spam_chats = []


VC_TAG = [ "@ل1 تشتريلي هدوم ونفطر سوا ؟",
"@ل2 تشتريلي هدوم ونفطر سوا ؟",
"@ل3 تشتريلي هدوم ونفطر سوا ؟",
"@ل4 تشتريلي هدوم ونفطر سوا ؟",
"@ل5 تشتريلي هدوم ونفطر سوا ؟",
"@ل6 تشتريلي هدوم ونفطر سوا ؟",
"@ل7 تشتريلي هدوم ونفطر سوا ؟",
"@ل8 تشتريلي هدوم ونفطر سوا ؟",
"@ل9 تشتريلي هدوم ونفطر سوا ؟",
"@ل10 تشتريلي هدوم ونفطر سوا ؟",
"@ل1 قولو با ايه مستفاد منك ؟",
"@ل2 قولو با ايه مستفاد منك ؟",
"@ل3 قولو با ايه مستفاد منك ؟",
"@ل4 قولو با ايه مستفاد منك ؟",
"@ل5 قولو با ايه مستفاد منك ؟",
"@ل6 قولو با ايه مستفاد منك ؟",
"@ل7 قولو با ايه مستفاد منك ؟",
"@ل8 قولو با ايه مستفاد منك ؟",
"@ل9 قولو با ايه مستفاد منك ؟",
"@ل10 قولو با ايه مستفاد منك ؟",
"@ل1 قولو تحبني",
"@ل2 قولو تحبني",
"@ل3 قولو تحبني",
"@ل4 قولو تحبني",
"@ل5 قولو تحبني",
"@ل6 قولو تحبني",
"@ل7 قولو تحبني",
"@ل8 قولو تحبني",
"@ل9 قولو تحبني",
"@ل10 قولو تحبني",
"@ل1 قولو اسألني سؤال",
"@ل2 قولو اسألني سؤال",
"@ل3 قولو اسألني سؤال",
"@ل4 قولو اسألني سؤال",
"@ل5 قولو اسألني سؤال",
"@ل6 قولو اسألني سؤال",
"@ل7 قولو اسألني سؤال",
"@ل8 قولو اسألني سؤال",
"@ل9 قولو اسألني سؤال",
"@ل10 قولو اسألني سؤال",
"@ل1 قولو اغنية لطيفة",
"@ل2 قولو اغنية لطيفة",
"@ل3 قولو اغنية لطيفة",
"@ل4 قولو اغنية لطيفة",
"@ل5 قولو اغنية لطيفة",
"@ل6 قولو اغنية لطيفة",
"@ل7 قولو اغنية لطيفة",
"@ل8 قولو اغنية لطيفة",
"@ل9 قولو اغنية لطيفة",
"@ل10 قولو اغنية لطيفة",
"@ل1 قولو نتجوز",
"@ل2 قولو نتجوز",
"@ل3 قولو نتجوز",
"@ل4 قولو نتجوز",
"@ل5 قولو نتجوز",
"@ل6 قولو نتجوز",
"@ل7 قولو نتجوز",
"@ل8 قولو نتجوز",
"@ل9 قولو نتجوز",
"@ل10 قولو نتجوز",
"@ل1 قولو كيف؟ تعرفت عليه؟",
"@ل2 قولو كيف؟ تعرفت عليه؟",
"@ل3 قولو كيف؟ تعرفت عليه؟",
"@ل4 قولو كيف؟ تعرفت عليه؟",
"@ل5 قولو كيف؟ تعرفت عليه؟",
"@ل6 قولو كيف؟ تعرفت عليه؟",
"@ل7 قولو كيف؟ تعرفت عليه؟",
"@ل8 قولو كيف؟ تعرفت عليه؟",
"@ل9 قولو كيف؟ تعرفت عليه؟",
"@ل10 قولو كيف؟ تعرفت عليه؟",
"@ل1 قولو نخلف اسراء سوا ؟",
"@ل2 قولو نخلف اسراء سوا ؟",
"@ل3 قولو نخلف اسراء سوا ؟",
"@ل4 قولو نخلف اسراء سوا ؟",
"@ل5 قولو نخلف اسراء سوا ؟",
"@ل6 قولو نخلف اسراء سوا ؟",
"@ل7 قولو نخلف اسراء سوا ؟",
"@ل8 قولو نخلف اسراء سوا ؟",
"@ل9 قولو نخلف اسراء سوا ؟",
"@ل10 قولو نخلف اسراء سوا ؟",
"@ل1 قولو لابس ايه ؟",
"@ل2 قولو لابس ايه ؟",
"@ل3 قولو لابس ايه ؟",
"@ل4 قولو لابس ايه ؟",
"@ل5 قولو لابس ايه ؟",
"@ل6 قولو لابس ايه ؟",
"@ل7 قولو لابس ايه ؟",
"@ل8 قولو لابس ايه ؟",
"@ل9 قولو لابس ايه ؟",
"@ل10 قولو لابس ايه ؟",
"@ل1 قولو قد ايه تحبني من 10",
"@ل2 قولو قد ايه تحبني من 10",
"@ل3 قولو قد ايه تحبني من 10",
"@ل4 قولو قد ايه تحبني من 10",
"@ل5 قولو قد ايه تحبني من 10",
"@ل6 قولو قد ايه تحبني من 10",
"@ل7 قولو قد ايه تحبني من 10",
"@ل8 قولو قد ايه تحبني من 10",
"@ل9 قولو قد ايه تحبني من 10",
"@ل10 قولو قد ايه تحبني من 10",
"@ل1 قولو هم تحس بيه؟",
"@ل2 قولو هم تحس بيه؟",
"@ل3 قولو هم تحس بيه؟",
"@ل4 قولو هم تحس بيه؟",
"@ل5 قولو هم تحس بيه؟",
"@ل6 قولو هم تحس بيه؟",
"@ل7 قولو هم تحس بيه؟",
"@ل8 قولو هم تحس بيه؟",
"@ل9 قولو هم تحس بيه؟",
"@ل10 قولو هم تحس بيه؟",
"@ل1 تزوجني اخوك/اختك ؟",
"@ل2 تزوجني اخوك/اختك ؟",
"@ل3 تزوجني اخوك/اختك ؟",
"@ل4 تزوجني اخوك/اختك ؟",
"@ل5 تزوجني اخوك/اختك ؟",
"@ل6 تزوجني اخوك/اختك ؟",
"@ل7 تزوجني اخوك/اختك ؟",
"@ل8 تزوجني اخوك/اختك ؟",
"@ل9 تزوجني اخوك/اختك ؟",
"@ل10 تزوجني اخوك/اختك ؟",
"@ل1 قولو احكيلي سر عنك بهمسة ؟",
"@ل2 قولو احكيلي سر عنك بهمسة ؟",
"@ل3 قولو احكيلي سر عنك بهمسة ؟",
"@ل4 قولو احكيلي سر عنك بهمسة ؟",
"@ل5 قولو احكيلي سر عنك بهمسة ؟",
"@ل6 قولو احكيلي سر عنك بهمسة ؟",
"@ل7 قولو احكيلي سر عنك بهمسة ؟",
"@ل8 قولو احكيلي سر عنك بهمسة ؟",
"@ل9 قولو احكيلي سر عنك بهمسة ؟",
"@ل10 قولو احكيلي سر عنك بهمسة ؟",
"@ل1 قولو هات بوسه",
"@ل2 قولو هات بوسه",
"@ل3 قولو هات بوسه",
"@ل4 قولو هات بوسه",
"@ل5 قولو هات بوسه",
"@ل6 قولو هات بوسه",
"@ل7 قولو هات بوسه",
"@ل8 قولو هات بوسه",
"@ل9 قولو هات بوسه",
"@ل10 قولو هات بوسه",
"@ل1 قولو اهديلي اغنية",
"@ل2 قولو اهديلي اغنية",
"@ل3 قولو اهديلي اغنية",
"@ل4 قولو اهديلي اغنية",
"@ل5 قولو اهديلي اغنية",
"@ل6 قولو اهديلي اغنية",
"@ل7 قولو اهديلي اغنية",
"@ل8 قولو اهديلي اغنية",
"@ل9 قولو اهديلي اغنية",
"@ل10 قولو اهديلي اغنية",
"@ل1 قولو كل حاجه بغيابك تختلف ؟",
"@ل2 قولو كل حاجه بغيابك تختلف ؟",
"@ل3 قولو كل حاجه بغيابك تختلف ؟",
"@ل4 قولو كل حاجه بغيابك تختلف ؟",
"@ل5 قولو كل حاجه بغيابك تختلف ؟",
"@ل6 قولو كل حاجه بغيابك تختلف ؟",
"@ل7 قولو كل حاجه بغيابك تختلف ؟",
"@ل8 قولو كل حاجه بغيابك تختلف ؟",
"@ل9 قولو كل حاجه بغيابك تختلف ؟",
"@ل10 قولو كل حاجه بغيابك تختلف ؟",
"@ل1 قولو اوصفني؟",
"@ل2 قولو اوصفني؟",
"@ل3 قولو اوصفني؟",
"@ل4 قولو اوصفني؟",
"@ل5 قولو اوصفني؟",
"@ل6 قولو اوصفني؟",
"@ل7 قولو اوصفني؟",
"@ل8 قولو اوصفني؟",
"@ل9 قولو اوصفني؟",
"@ل10 قولو اوصفني؟",
"@ل1 قولو يجي يوم ونتفارق؟",
"@ل2 قولو يجي يوم ونتفارق؟",
"@ل3 قولو يجي يوم ونتفارق؟",
"@ل4 قولو يجي يوم ونتفارق؟",
"@ل5 قولو يجي يوم ونتفارق؟",
"@ل6 قولو يجي يوم ونتفارق؟",
"@ل7 قولو يجي يوم ونتفارق؟",
"@ل8 قولو يجي يوم ونتفارق؟",
"@ل9 قولو يجي يوم ونتفارق؟",
"@ل10 قولو يجي يوم ونتفارق؟",
"@ل1 قولو تعال اتنفسك صدقني مخنوق",
"@ل2 قولو تعال اتنفسك صدقني مخنوق",
"@ل3 قولو تعال اتنفسك صدقني مخنوق",
"@ل4 قولو تعال اتنفسك صدقني مخنوق",
"@ل5 قولو تعال اتنفسك صدقني مخنوق",
"@ل6 قولو تعال اتنفسك صدقني مخنوق",
"@ل7 قولو تعال اتنفسك صدقني مخنوق",
"@ل8 قولو تعال اتنفسك صدقني مخنوق",
"@ل9 قولو تعال اتنفسك صدقني مخنوق",
"@ل10 قولو تعال اتنفسك صدقني مخنوق",
"@ل1 قولو نسافر لباريس سوه",
"@ل2 قولو نسافر لباريس سوه",
"@ل3 قولو نسافر لباريس سوه",
"@ل4 قولو نسافر لباريس سوه",
"@ل5 قولو نسافر لباريس سوه",
"@ل6 قولو نسافر لباريس سوه",
"@ل7 قولو نسافر لباريس سوه",
"@ل8 قولو نسافر لباريس سوه",
"@ل9 قولو نسافر لباريس سوه",
"@ل10 قولو نسافر لباريس سوه",
"@ل1 قولو نتكلم مكالمه ٣ ساعات ؟",
"@ل2 قولو نتكلم مكالمه ٣ ساعات ؟",
"@ل3 قولو نتكلم مكالمه ٣ ساعات ؟",
"@ل4 قولو نتكلم مكالمه ٣ ساعات ؟",
"@ل5 قولو نتكلم مكالمه ٣ ساعات ؟",
"@ل6 قولو نتكلم مكالمه ٣ ساعات ؟",
"@ل7 قولو نتكلم مكالمه ٣ ساعات ؟",
"@ل8 قولو نتكلم مكالمه ٣ ساعات ؟",
"@ل9 قولو نتكلم مكالمه ٣ ساعات ؟",
"@ل10 قولو نتكلم مكالمه ٣ ساعات ؟",
"@ل1 قولو ننام سوا بفراش واحد ؟",
"@ل2 قولو ننام سوا بفراش واحد ؟",
"@ل3 قولو ننام سوا بفراش واحد ؟",
"@ل4 قولو ننام سوا بفراش واحد ؟",
"@ل5 قولو ننام سوا بفراش واحد ؟",
"@ل6 قولو ننام سوا بفراش واحد ؟",
"@ل7 قولو ننام سوا بفراش واحد ؟",
"@ل8 قولو ننام سوا بفراش واحد ؟",
"@ل9 قولو ننام سوا بفراش واحد ؟",
"@ل10 قولو ننام سوا بفراش واحد ؟",
"@ل1 قولو سكرين لخاصك ؟",
"@ل2 قولو سكرين لخاصك ؟",
"@ل3 قولو سكرين لخاصك ؟",
"@ل4 قولو سكرين لخاصك ؟",
"@ل5 قولو سكرين لخاصك ؟",
"@ل6 قولو سكرين لخاصك ؟",
"@ل7 قولو سكرين لخاصك ؟",
"@ل8 قولو سكرين لخاصك ؟",
"@ل9 قولو سكرين لخاصك ؟",
"@ل10 قولو سكرين لخاصك ؟",
"@ل1 قولو معايا عليك فضيحه",
"@ل2 قولو معايا عليك فضيحه",
"@ل3 قولو معايا عليك فضيحه",
"@ل4 قولو معايا عليك فضيحه",
"@ل5 قولو معايا عليك فضيحه",
"@ل6 قولو معايا عليك فضيحه",
"@ل7 قولو معايا عليك فضيحه",
"@ل8 قولو معايا عليك فضيحه",
"@ل9 قولو معايا عليك فضيحه",
"@ل10 قولو معايا عليك فضيحه",
        ]



@app.on_message(filters.command(["تاك تفاعل"], prefixes=["", "@", "#"]))
async def mention_allvc(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("๏ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴏɴʟʏ ғᴏʀ ɢʀᴏᴜᴘs.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴀᴅᴍɪɴ ʙᴀʙʏ, ᴏɴʟʏ ᴀᴅᴍɪɴs ᴄᴀɴ ᴛᴀɢ ᴍᴇᴍʙᴇʀs. ")
    if chat_id in spam_chats:
        return await message.reply("๏ ᴘʟᴇᴀsᴇ ᴀᴛ ғɪʀsᴛ sᴛᴏᴘ ʀᴜɴɴɪɴɢ ᴍᴇɴᴛɪᴏɴ ᴘʀᴏᴄᴇss...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += f"[{usr.user.first_name}](tg://user?id={usr.user.id}) "

        if usrnum == 1:
            txt = f"{usrtxt} {random.choice(VC_TAG)}"
            await client.send_message(chat_id, txt)
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass



@app.on_message(filters.command(["تاك بس"], prefixes=["", "@", "#"]))
async def cancel_spam(client, message):
    if not message.chat.id in spam_chats:
        return await message.reply("๏ ᴄᴜʀʀᴇɴᴛʟʏ ɪ'ᴍ ɴᴏᴛ ᴛᴀɢɢɪɴɢ ʙᴀʙʏ.")
    is_admin = False
    try:
        participant = await client.get_chat_member(message.chat.id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("๏ ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴀᴅᴍɪɴ ʙᴀʙʏ, ᴏɴʟʏ ᴀᴅᴍɪɴs ᴄᴀɴ ᴛᴀɢ ᴍᴇᴍʙᴇʀs.")
    else:
        try:
            spam_chats.remove(message.chat.id)
        except:
            pass
        return await message.reply("๏ ᴍᴇɴᴛɪᴏɴ ᴘʀᴏᴄᴇss sᴛᴏᴘᴘᴇᴅ ๏")
